# **Handling Missing Data With Pandas**
# Introduction to Data Cleaning

In [1]:
import numpy as np
import pandas as pd

 Pandas utility functions

In [2]:
pd.isnull(np.nan) #nan = not a number

True

In [5]:
pd.isnull(None)

True

In [6]:
pd.isnull(pd.Series ([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [8]:
pd.notnull(pd.Series ([1, np.nan, 7, np.nan]))

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
s = pd.Series([1, 2, 3, np.nan, 5, np.nan, 6, np.nan, 8])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    NaN
6    6.0
7    NaN
8    8.0
dtype: float64

In [10]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4     True
5    False
6     True
7    False
8     True
dtype: bool

In [11]:
pd.notnull(s).sum()  #prints out how many "true" there are

6

In [12]:
pd.isnull(s).sum() #prints out how many "False" there are

3

In [13]:
s.notnull()

0     True
1     True
2     True
3    False
4     True
5    False
6     True
7    False
8     True
dtype: bool

In [14]:
s.notnull().sum()

6

# **Duplicates**

In [22]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Harry Styles',
    'Cristiano Messi',
    'Nepali Kancha'
])

ambassadors.name = ' Countries'

In [23]:
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Harry Styles                 Germany
Cristiano Messi              Germany
Nepali Kancha                Germany
Name:  Countries, dtype: object

In [24]:
ambassadors.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Harry Styles          False
Cristiano Messi        True
Nepali Kancha          True
Name:  Countries, dtype: bool

This considers the first occurance of the value as not-duplicate so In The case of UK, we can see that 'Kin Darroch' is True and other is the false.

In [25]:
ambassadors.duplicated(keep = 'last')

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Harry Styles           True
Cristiano Messi        True
Nepali Kancha         False
Name:  Countries, dtype: bool

Flips the result meaning the last occurance is considered True

In [28]:
ambassadors.duplicated(keep = False)

Gérard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Harry Styles           True
Cristiano Messi        True
Nepali Kancha          True
Name:  Countries, dtype: bool

In [30]:
ambassadors.drop_duplicates()

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Harry Styles                 Germany
Name:  Countries, dtype: object

Completely elimates the duplicated values